# MechanicalEquipmentSetOnDuty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MechanicalEquipmentSetOnDuty Property
ParameterTypeId Class See Also
---
"On Duty"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MechanicalEquipmentSetOnDuty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MechanicalEquipmentSetOnDuty As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MechanicalEquipmentSetOnDuty {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace